---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalloadOtherParam
source: html/29611400-00a9-71cb-0a2c-21cdb57c99c5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalloadOtherParam Property

"Other Total Connected"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecPanelTotalloadOtherParam { get; }
```